<template>
    <section class="reviews-list row">
        <div class="reviews-list__item col-lg-6" v-for="(item,index) in reviews">
            <review-item v-if="!item.banner"></review-item>
            <figure class="reviews-list__banner" :style="{backgroundImage:'url(' + item.img + ')'}" v-else>
            </figure>
        </div>
    </section>
</template>
<script>
    import ReviewItem from "../../components/reviews/ReviewItem";
    export default {
        components: {
            ReviewItem,
        },
        data() {
            return {
                reviews: [
                    {
                        title: "Сдала на 5!!!",
                        text: "Очень часто студенты проверяют свои курсовые, дипломные работы или рефераты в бесплатной версии (общедоступной).           Антиплагиат, получив высокий процент уникальности при проверке - отправляют преподавателю такую работу. После проверки преподаватель сообщает, что уникальность очень низкая и нужно переделать.",
                        name: "Коваленко Наталья",
                        date: "12.02.2021",
                    },
                    {
                        title: "Сдала на 5!!!",
                        text: "Очень часто студенты проверяют свои курсовые, дипломные работы или рефераты в бесплатной версии (общедоступной).           Антиплагиат, получив высокий процент уникальности при проверке - отправляют преподавателю такую работу. После проверки преподаватель сообщает, что уникальность очень низкая и нужно переделать.",
                        name: "Коваленко Наталья",
                        date: "12.02.2021",
                    },
                    {
                        title: "Сдала на 5!!!",
                        text: "Очень часто студенты проверяют свои курсовые, дипломные работы или рефераты в бесплатной версии (общедоступной).           Антиплагиат, получив высокий процент уникальности при проверке - отправляют преподавателю такую работу. После проверки преподаватель сообщает, что уникальность очень низкая и нужно переделать.",
                        name: "Коваленко Наталья",
                        date: "12.02.2021",
                    },
                    {
                        img: "/assets/site/images/reviews/review-banner.png",
                        banner:true,
                    },
                ],
            }
        },

    }
</script>
