<template>
    <section class="price-page">
        <price-list
            :key="index"
            :data="item" v-for="(item, index) in prices"></price-list>
    </section>
</template>
<script>
    import PriceList from "../../components/price-list";
    export default {
        components: {
            PriceList,
        },
        data() {
            return {
                prices : [
                    {
                        title:"Системы проверки уникальности текста:",
                        button:true,
                        label: "Система проверки:",
                        list: [
                            {
                                title:"NASH Antiplagiat",
                                logo: "/assets/site/images/systems/1.png",
                                description: "У вашего текста низкий процент уникальности, мы рекомендуем вам проверить его в платных системах или воспользоваться услугой рерайта",
                                price: "249 руб"
                            },
                            {
                                title:"NASH «Без ожидания»",
                                logo: "/assets/site/images/systems/1.png",
                                description: "У вашего текста низкий процент уникальности, мы рекомендуем вам проверить его в платных системах или воспользоваться услугой рерайта",
                                price: "249 руб"
                            },
                            {
                                title:"Text.ru",
                                logo: "/assets/site/images/systems/2.png",
                                description: "У вашего текста низкий процент уникальности, мы рекомендуем вам проверить его в платных системах или воспользоваться услугой рерайта",
                                price: "249 руб"
                            },
                        ],
                    },
                    {
                        title:"Дополнительные услуги:",
                        button:false,
                        label: "Услуга:",
                        description: "Вы можете заказать дополнительные услуги при выборе платной системы проверки",
                        list: [
                            {
                                title:"Полный аудит документа",
                                description: "У вашего текста низкий процент уникальности, мы рекомендуем вам проверить его в платных системах или воспользоваться услугой рерайта",
                                price: "249 руб"
                            },
                            {
                                title:"Полный аудит документа",
                                description: "У вашего текста низкий процент уникальности, мы рекомендуем вам проверить его в платных системах или воспользоваться услугой рерайта",
                                price: "249 руб"
                            },
                            {
                                title:"Полный аудит документа",
                                description: "У вашего текста низкий процент уникальности, мы рекомендуем вам проверить его в платных системах или воспользоваться услугой рерайта",
                                price: "249 руб"
                            },
                            {
                                title:"Полный аудит документа",
                                description: "У вашего текста низкий процент уникальности, мы рекомендуем вам проверить его в платных системах или воспользоваться услугой рерайта",
                                price: "249 руб"
                            },
                        ],
                    },
                    {
                        title:"Повышение уникальности текста:",
                        button:true,
                        label: "Услуга:",
                        last:true,
                        list: [
                            {
                                title:"",
                                class:true,
                                description: "Очень часто студенты проверяют свои курсовые,  работы или рефераты в бесплатной версии ",
                                price: "Индивидуально"
                            },
                        ],
                    },
                ]
            }
        },
    }
</script>
